app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" WHERE (section number LIKE '%database%') ORDER BY created_at DESC
---
  def index
    @courses = Course.all

INSERT INTO "courses" ("name", "section_number", "semester", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "web app"], ["section_number", 1234], ["semester", "fall 2017"], ["date", "2017-09-25"], ["created_at", "2017-09-25 06:36:39.544142"], ["updated_at", "2017-09-25 06:36:39.544142"]]
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save

UPDATE "courses" SET "section_number" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["section_number", 4321], ["updated_at", "2017-12-13 07:47:20.363413"], ["id", 4]]
---
  def update
    respond_to do |format|
      if @course.update(course_params)