app/controllers/enrollments_controller.rb

  def index
    @enrollments = Enrollment.all
---
SELECT "enrollments".* FROM "enrollments" WHERE (student LIKE '%987654%') ORDER BY created_at DESC

  def new
    @enrollment = Enrollment.new
    @sections = Section.order(:section_number)
    @students = Student.order(:id_number)
---
SELECT "sections".* FROM "sections" ORDER BY "sections"."section_number" ASC
SELECT "students".* FROM "students" ORDER BY "students"."id_number" ASC

  def create
    @enrollment = Enrollment.new(enrollment_params)


    respond_to do |format|
      if @enrollment.save
---
INSERT INTO "enrollments" ("created_at", "updated_at", "section_id", "student_id") VALUES (?, ?, ?, ?)  [["created_at", "2017-12-07 23:17:12.977869"], ["updated_at", "2017-12-07 23:17:12.977869"], ["section_id", 3], ["student_id", 1]]

  def destroy
    @enrollment.destroy
---
DELETE FROM "enrollments" WHERE "enrollments"."id" = ?  [["id", 1]]

    def set_enrollment
      @enrollment = Enrollment.find(params[:id])
---
SELECT  "enrollments".* FROM "enrollments" WHERE "enrollments"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]