app/controllers/professors_controller.rb

  def index
    @professors = Professor.all
---
SELECT "professors".* FROM "professors" WHERE (name LIKE '%steve beaty%') ORDER BY created_at DESC

  def show
    @sections = Section.order(:section_number)
---
SELECT "sections".* FROM "sections" ORDER BY "sections"."section_number" ASC

  def new
    @professor = Professor.new
    @students = Student.order(:id_number)
    @sections = Section.order(:section_number)
---
SELECT "students".* FROM "students" ORDER BY "students"."id_number" ASC
SELECT "sections".* FROM "sections" ORDER BY "sections"."section_number" ASC

  def edit
    @professor = Professor.find(params[:id])
---
SELECT  "professors".* FROM "professors" WHERE "professors"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def create
    @professor = Professor.new(professor_params)

    respond_to do |format|
      if @professor.save
---
INSERT INTO "professors" ("name", "course_name", "section_number", "created_at", "updated_at", "student_id") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Cohen Blanche"], ["course_name", "database"], ["section_number", 4321], ["created_at", "2017-12-13 07:20:09.288953"], ["updated_at", "2017-12-13 07:20:09.288953"], ["student_id", 7]]

  def destroy
    @professor.destroy
---
DELETE FROM "professors" WHERE "professors"."id" = ?  [["id", 4]]

    def set_professor
      @professor = Professor.find(params[:id])
---
SELECT  "professors".* FROM "professors" WHERE "professors"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]