app/controllers/sections_controller.rb

SELECT "sections".* FROM "sections" WHERE (course_name LIKE '%database%') ORDER BY created_at DESC
SELECT "sections".* FROM "sections" WHERE (section_number LIKE '%4321%') ORDER BY "sections"."section_number" ASC, created_at DESC
---
  def index
    @sections= Section.all
    if params[:search]
    @sections = Section.order(:section_number).search(params[:search]).order("created_at DESC")

SELECT "courses".* FROM "courses" ORDER BY "courses"."name" ASC
SELECT "professors".* FROM "professors" ORDER BY "professors"."name" ASC
---
  def new
    @section = Section.new
    @courses = Course.order(:name)
    @professors = Professor.order(:name)

SELECT  "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "courses".* FROM "courses" ORDER BY "courses"."name" ASC
SELECT "professors".* FROM "professors" ORDER BY "professors"."name" ASC
---
  def edit
    @section = Section.find(params[:id])
    @courses = Course.order(:name)
    @professors = Professor.order(:name)

INSERT INTO "sections" ("created_at", "updated_at", "course_id", "professor_id", "section_number") VALUES (?, ?, ?, ?, ?)  [["created_at", "2017-12-13 07:34:17.709809"], ["updated_at", "2017-12-13 07:34:17.709809"], ["course_id", 2], ["professor_id", 6], ["section_number", 4321]]
---
  def create
    @section = Section.new(section_params)

    respond_to do |format|
      if @section.save

UPDATE "sections" SET "course_id" = ?, "professor_id" = ?, "updated_at" = ? WHERE "sections"."id" = ?  [["course_id", 1], ["professor_id", 2], ["updated_at", "2017-10-05 06:09:29.317111"], ["id", 3]]
---
  def update
    respond_to do |format|
      if @section.update(section_params)

DELETE FROM "sections" WHERE "sections"."id" = ?  [["id", 1]]
---
  def destroy
    @section.destroy

SELECT  "sections".* FROM "sections" WHERE "sections"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
---
    def set_section
      @section = Section.find(params[:id])