app/controllers/students_controller.rb

  def new
    @student = Student.new
    @sections = Section.order(:section_number)
    @professors = Professor.order(:name)
---
SELECT "sections".* FROM "sections" ORDER BY "sections"."section_number" ASC
SELECT "professors".* FROM "professors" ORDER BY "professors"."name" ASC

  def edit
    @student = Student.find(params[:id])
    @sections = Section.order(:section_number)
    @professors = Professor.order(:name)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "sections".* FROM "sections" ORDER BY "sections"."section_number" ASC
SELECT "professors".* FROM "professors" ORDER BY "professors"."name" ASC

  def create
    @student = Student.new(student_params)

    respond_to do |format|
      if @student.save
---
INSERT INTO "students" ("id_number", "first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["id_number", 477499], ["first_name", "Ronald"], ["last_name", "Aparicio"], ["created_at", "2017-11-02 22:04:12.211562"], ["updated_at", "2017-11-02 22:04:12.211562"]]

  def update
    respond_to do |format|
      if @student.update(student_params)
---
UPDATE "students" SET "enrolled_section" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["enrolled_section", 4321], ["updated_at", "2017-11-30 21:18:06.167012"], ["id", 1]]